from hemming.HemmingNetwork import HemmingNetwork
import numpy as np

inputs = np.array([[10.0, 15.0, 18.0, 400.0, 1, 2, 1.0, 50.0, 1000, 3, 12, "Huge"],  # Белаз
                   [10.0, 14.0, 18.0, 410.0, 1, 2, 1.0, 52.0, 950, 3, 12, "Huge"],  # Белаз
                   [2.1, 4.0, 1.3, 1.3, 5, 0, 0.16, 2.2, 180, 0, 4, "Little"],  # Легковой автомобиль
                   [2.0, 4.8, 1.3, 1.5, 5, 0, 0.2, 2.2, 190, 0, 4, "Little"],  # Легковой автомобиль
                   [2.1, 4.7, 1.5, 1.4, 5, 0, 0.2, 2.2, 200, 0, 4, "Little"],  # Легковой автомобиль
                   [11.0, 14.0, 18.0, 410.0, 1, 2, 1.0, 52.0, 950, 3, 12, "Huge"],  # Белаз
                   [1.8, 4.5, 1.4, 1.2, 5, 0, 0.10, 1.9, 170, 0, 4, "Little"],  # Легковой автомобиль
                   [2.0, 4.8, 1.3, 1.5, 5, 0, 0.2, 2.2, 190, 0, 4, "Little"],  # Легковой автомобиль
                   [2.1, 4.3, 1.4, 1.2, 5, 0, 0.2, 2.0, 120, 0, 4, "Little"],  # Легковой автомобиль
                   [2.0, 4.5, 1.5, 1.5, 5, 0, 0.18, 2.0, 150, 0, 4, "Little"],  # Легковой автомобиль
                   [2.1, 4.3, 1.4, 1.2, 5, 0, 0.2, 2.0, 120, 0, 4, "Little"],  # Легковой автомобиль
                   [2.7, 14.0, 3.9, 5.4, 55, 1, 0.22, 4.2, 380, 2, 8, "Big"],  # Автобус
                   [2.7, 14.0, 3.9, 5.4, 55, 1, 0.22, 4.2, 390, 2, 8, "Big"],  # Автобус
                   [2.0, 4.8, 1.3, 1.5, 5, 0, 0.2, 2.2, 190, 0, 4, "Little"],  # Легковой автомобиль
                   [10.0, 15.0, 18.0, 405.0, 1, 2, 1.0, 52.0, 1000, 3, 12, "Huge"],  # Белаз
                   [2.7, 14.0, 3.9, 5.4, 55, 1, 0.22, 4.2, 380, 2, 8, "Big"],  # Автобус
                   [2.0, 4.8, 1.3, 1.5, 5, 0, 0.2, 2.2, 190, 0, 4, "Little"],  # Легковой автомобиль
                   [11.0, 14.5, 17.5, 405.0, 1, 2, 1.0, 51.0, 975, 3, 12, "Huge"],  # Белаз
                   [2.1, 4.7, 1.5, 1.4, 5, 0, 0.2, 2.2, 200, 0, 4, "Little"],  # Легковой автомобиль
                   [1.8, 4.5, 1.4, 1.2, 5, 0, 0.10, 1.9, 170, 0, 4, "Little"],  # Легковой автомобиль
                   [2.0, 4.8, 1.3, 1.5, 5, 0, 0.2, 2.2, 190, 0, 4, "Little"],  # Легковой автомобиль
                   [2.7, 14.0, 3.9, 5.4, 55, 1, 0.22, 4.2, 380, 2, 8, "Big"],  # Автобус
                   [2.7, 14.0, 3.9, 5.4, 60, 1, 0.22, 4.2, 380, 2, 8, "Big"],  # Автобус
                   [2.1, 4.3, 1.4, 1.2, 5, 0, 0.2, 2.0, 120, 0, 4, "Little"],  # Легковой автомобиль
                   [2.0, 4.5, 1.5, 1.5, 5, 0, 0.18, 2.0, 150, 0, 4, "Little"],  # Легковой автомобиль
                   [10.5, 14.7, 18.5, 415.0, 1, 2, 1.0, 51.0, 1050, 3, 12, "Huge"],  # Белаз
                   [2.1, 4.3, 1.4, 1.2, 5, 0, 0.2, 2.0, 120, 0, 4, "Little"],  # Легковой автомобиль
                   [2.7, 16.0, 4.1, 5.3, 60, 1, 0.22, 4.1, 370, 2, 8, "Big"],  # Автобус
                   [2.9, 14.0, 4.2, 5.5, 40, 1, 0.22, 4.2, 380, 2, 8, "Big"],  # Автобус
                   [1.9, 4.5, 1.4, 1.2, 5, 0, 0.17, 2.3, 160, 0, 4, "Little"]], dtype=object)  # Легковой автомобиль

inputs = HemmingNetwork.conversionToFloat(inputs)
min_vals1 = np.min(inputs, axis=0)
max_vals1 = np.max(inputs, axis=0)
inputs = HemmingNetwork.normalize(inputs)
inputs = HemmingNetwork.merge_similar_arrays(inputs)
hn = HemmingNetwork(input_size=inputs.shape[1], num_classes=inputs.shape[0])

hn.train(inputs)
# 0 ширина, 1 длина, 2 высота, 3 масса, 4 кол-во мест, 5 привод (0 передний, 1 задний 2 полный), 6 клиренс, 7 объём двигателя, 8 лошадинные силы, 9 тип топлива (0 бензин, 1 дизель, 2 гибрид, 3 электро), 10 кол-во колес, 11 размер
inp = np.array([[2.7, 14.0, 3.9, 5.8, 55, 1, 0.23, 4.2, 400, 2, 8, "Big"]], dtype=object)
inp = HemmingNetwork.conversionToFloat(inp)
inp = 2 * (inp - min_vals1) / (max_vals1 - min_vals1) - 1
classification = hn.classify(inp[0])
print(classification)